{
  "basics": {
    "name": "Alexiy Charamko",
    "label": "Data Scientist and Engineer",
    "email": "alexiy.charamko@luteus.io",
    "phone": "+84382727120",
    "website": "linkedin.com/alexiy-charamko/",
    "summary": "I have a passion for mathematical modeling and developing well-architected systems to solve real world problems.\n\nIn solving problems I focus on finding and implementing references to the real world phenomena - for example identifying traits that are relevant to a problem, or designing a data model that reflects the real world.\n\nI bring with me experience working in multiple verticals and disciplines: physical retail, finance and lending, digital marketing, mechanical engineering, & genetics.\n",
    "location": {
      "postalCode": "10000",
      "city": "Ho Chi Minh City",
      "countryCode": "VN",
      "region": ""
    },
    "pdf": "alexiy-charamko.pdf"
  },
  "work": [
    {
      "company": "Uno Home Loans",
      "current": true,
      "position": "Team Lead and Data Scientist",
      "startDate": "2017-07",
      "summary": "Lead for a team of 2 other data analysts, reporting directly to CTO and other C-levels.",
      "highlights": [
        "Designed and developed sales lead prioritisation model using random forests (leadScore).",
        "Designed and developed ad-hoc machine learning models to understand customer propensity to do X or have Y value.",
        "Designed and developed machine learning unsupervised clustering of customers for marketing personas.",
        "Designed and developed a machine learning model to understand the characteristics of a complex financial calculator (loan serviceability).",
        "Designed and developed customer facing algorithm for assessing their current home loan (loanScore, Australian Good Design Award 2020).",
        "Established core data development library - automated deployment, automated testing, common library functions and classes",
        "Established data governance framework - nomenclature, data dictionaries, access roles, work prioritisation flow, development flow, secure sharing of data.",
        "Designed and developed automated framework for machine learning environment creation using AWS CLI, terraform, and AWS Sagemaker.",
        "Designed and developed data lake, data warehouse and ETL processing jobs for ~20 data sources using event sourcing pattern, PySpark, AWS Lake Formation, AWS S3, AWS Glue, AWS Redshift, AWS DMS, AWS CLI, and terraform.",
        "Designed entity relationship model for the business.",
        "Designed and developed various self-serve dashboards and ad-hoc analyses using Tableau, Apache Zeppelin, Jupyter Notebooks, and later Mode Analytics."
      ]
    },
    {
      "company": "Recovery Brands",
      "current": false,
      "position": "Frontend Engineer",
      "website": "https://www.recoverybrands.com",
      "startDate": "May 2013",
      "endDate": "June 2017",
      "summary": "Add features and fix bugs for Recovery Brands network of websites.",
      "highlights": [
        "Built \"Recovery Brands\" Sass framework, its automated build process, and documentation.",
        "Implemented structured data markup across multiple websites of \"Recovery Brands\" network, which led to a 5% increase in CTR.",
        "Consistently took part in adding new features for a network of 20+ WordPress websites (such as Rehabs.com) with a total amount of 5m+ visitors per month.",
        "Ran workshops and talks on CSS & Sass architecture for the team of 5 frontend developers."
      ]
    },
    {
      "company": "Udacity",
      "current": false,
      "position": "Frontend Developer [Remote]",
      "website": "https://www.udacity.com",
      "startDate": "April 2016",
      "endDate": "August 2016",
      "summary": "Sass architecture and development of Udacity Blitz React app.",
      "highlights": [
        "Frontend Sass development with the focus on reusability and cross-browser compatibility.",
        "Implemented the Udacity Blitz UI kit using Sass.",
        "Implemented UI atoms."
      ]
    }
  ],
  "education": [
    {
      "institution": "The University of New South Wales",
      "area": "Mechanical and Manufacturing Engineering",
      "studyType": "Bachelor's degree",
      "endDate": "2014"
    },
    {
      "institution": "The University of New South Wales",
      "area": "Genetics",
      "studyType": "Bachelor's degree",
      "endDate": "2016"
    }
  ],
  "skills": {
    "keywords": [
      "Bayesian and Fisher statistics",
      "Random forests",
      "Neural networks",
      "PCA",
      "Mathematical simulations",
      "Signal processing",
      "Linear systems and control engineering",
      "Experiment design",
      "SQL RDBMS’",
      "Apache Spark",
      "Apache Kafka",
      "AWS DynamoDB",
      "AWS S3",
      "AWS Glue",
      "AWS Redshift",
      "InfluxDB",
      "D3.js",
      "Vega.js",
      "ggplot",
      "seaborn",
      "Tableau",
      "Amplitude",
      "Apache Zeppelin",
      "Mode Analytics",
      "Grafana",
      "Google Analytics",
      "Jupyter Notebooks",
      "Python",
      "R",
      "Javascript",
      "HTML",
      "CSS",
      "git",
      "docker",
      "k8s",
      "CI/CD",
      "make files",
      "shell/bash",
      "terraform",
      "AWS ECS",
      "AWS Lambda",
      "Data governance frameworks",
      "Data naming conventions",
      "Metadata",
      "Data lineaga",
      "Data work prioritisation",
      "Data roles and access",
      "Data security"
    ]
  }
}
