{
  "basics": {
    "name": "Alexiy Charamko",
    "label": "Data Scientist and Engineer",
    "email": "alexiy.charamko@luteus.io",
    "phone": "+84382727120",
    "website": "linkedin.com/alexiy-charamko/",
    "summary": "I have a passion for mathematical modeling and developing well-architected systems to solve real world problems. In solving problems I focus on finding and implementing references to the underlying real world phenomena.",
    "location": {
      "postalCode": "10000",
      "city": "Ho Chi Minh City",
      "countryCode": "VN",
      "region": ""
    },
    "pdf": "alexiy-charamko.pdf"
  },
  "work": [
    {
      "company": "Uno Home Loans",
      "current": true,
      "position": "Team Lead and Data Scientist",
      "website": "https://unohomeloans.com.au/",
      "startDate": "2017-07",
      "summary": "Lead for a team of 2 other data analysts, reporting directly to CTO and other C-levels.",
      "highlights": [
        "Designed and developed sales lead prioritisation model using random forests (leadScore).",
        "Designed and developed ad-hoc machine learning models to understand customer propensity to do X or have Y value.",
        "Designed and developed machine learning unsupervised clustering of customers for marketing personas.",
        "Designed and developed a machine learning model to understand the characteristics of a complex financial calculator (loan serviceability).",
        "Designed and developed customer facing algorithm for assessing their current home loan (loanScore, Australian Good Design Award 2020).",
        "Established core data development library - automated deployment, automated testing, common library functions and classes",
        "Established data governance framework - nomenclature, data dictionaries, access roles, work prioritisation flow, development flow, secure sharing of data.",
        "Designed and developed automated framework for machine learning environment creation using AWS CLI, terraform, and AWS Sagemaker.",
        "Designed and developed data lake, data warehouse and ETL processing jobs for ~20 data sources using event sourcing pattern, PySpark, AWS Lake Formation, AWS S3, AWS Glue, AWS Redshift, AWS DMS, AWS CLI, and terraform.",
        "Designed entity relationship model for the business.",
        "Designed and developed various self-serve dashboards and ad-hoc analyses using Tableau, Apache Zeppelin, Jupyter Notebooks, and later Mode Analytics."
      ]
    },
    {
      "company": "Skyfii",
      "current": false,
      "position": "Data Scientist",
      "website": "https://skyfii.io/",
      "startDate": "2016-11",
      "endDate": "2017-06",
      "summary": "Junior in a team of 3 data scientists.",
      "highlights": [
        "Designed and developed clustering analysis of spatial movement data.",
        "Designed and developed metrics based on spatial movement data and retail sales.",
        "Designed and automated creation of reports to present to customers.",
        "Worked with sales and spatial data from 1000s of physical locations (typically retail)."
      ]
    },
    {
      "company": "UNSW Voineagu Group",
      "current": false,
      "position": "Research Assistant (Hons.)",
      "website": "https://www.babs.unsw.edu.au/research/facilities-services/voineagu-lab",
      "startDate": "2015-07",
      "endDate": "2016-07",
      "summary": "Conducting research to further laboratory topics, and teaching interns.",
      "highlights": [
        "Developed data analysis pipeline for multi-tissue genomic data (> 500 GB).",
        "Automated statistical testing and data exploration.",
        "Investigated statistical and real-world (biological) significance of analyses.",
        "Co-authored paper - http://dx.doi.org/10.1007/s00018-016-2304-0"
      ]
    }
  ],
  "education": [
    {
      "institution": "The University of New South Wales",
      "area": "Genetics + Mechanical and Manufacturing Engineering",
      "studyType": "Bachelor's degree",
      "endDate": "2016"
    }
  ],
  "skills": {
    "keywords": [
      "Bayesian and Fisher statistics",
      "Random forests",
      "Neural networks",
      "PCA",
      "Mathematical simulations",
      "Signal processing",
      "Linear systems and control engineering",
      "Experiment design",
      "SQL RDBMS’",
      "Apache Spark",
      "Apache Kafka",
      "AWS DynamoDB",
      "AWS S3",
      "AWS Glue",
      "AWS Redshift",
      "InfluxDB",
      "D3.js",
      "Vega.js",
      "ggplot",
      "seaborn",
      "Tableau",
      "Amplitude",
      "Apache Zeppelin",
      "Mode Analytics",
      "Grafana",
      "Google Analytics",
      "Jupyter Notebooks",
      "Python",
      "R",
      "Javascript",
      "HTML",
      "CSS",
      "git",
      "docker",
      "k8s",
      "CI/CD",
      "make files",
      "shell/bash",
      "terraform",
      "AWS ECS",
      "AWS Lambda"
    ]
  }
}
